# FieldValues Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldValues Members
FieldValues Class Constructors Methods Properties See Also
---
The FieldValues type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FieldValues(FieldValues) | Creates a copy of the given FieldValues instance. |
| FieldValues(IList<(Of <<'(ValueAtPoint>)>>)) | Creates object from an array of domain point values |
| FieldValues(IList<(Of <<'(VectorAtPoint>)>>)) | Creates object from an array of domain point vectors |
| FieldValues(IList<(Of <<'(ValueAtPoint>)>>), XYZ) | Creates object from an array of domain point values |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FieldValues |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FieldValues Class
Autodesk.Revit.DB.Analysis Namespace